{
  "metadata": {
    "search_job_title": "Data Scientist_detailed",
    "search_location": "San Francisco, CA",
    "timestamp": "2025-09-05T19:32:49.321343",
    "total_jobs": 10
  },
  "data": {
    "job": [
      {
        "title": "Data Scientist",
        "company": "BICP",
        "location": "San Francisco, CA",
        "description": "\n\n \n  Location: San Francisco, California\n \n \n  As a Data Scientist at BICP your role is to analyze, visualize, and model data. You’ll build and implement machine learning models to make more efficient and effective decisions. We are looking for a mixture between a statistician, scientist, machine learning expert and engineer: someone who has passion for building and improving Internet-scale products informed by data. Bachelor’s degree required and Master’s is preferred.\n \n",
        "url": "https://www.indeed.com/viewjob?jk=419bf92eb94d3757",
        "source_url": "https://www.indeed.com/m/viewjob?jk=419bf92eb94d3757&from=serp&tk=1j4d17bmpgglo81c&xkcb=SoB767M3tNKSobAFvr0LbzkdCdPP"
      },
      {
        "title": "Data Scientist",
        "company": "LiveRamp",
        "location": "San Francisco, CA",
        "description": "\n \n  LiveRamp is the data collaboration platform of choice for the world’s most innovative companies. A groundbreaking leader in consumer privacy, data ethics, and foundational identity, LiveRamp is setting the new standard for building a connected customer view with unmatched clarity and context while protecting precious brand and consumer trust. LiveRamp offers complete flexibility to collaborate wherever data lives to support the widest range of data collaboration use cases—within organizations, between brands, and across its premier global network of top-quality partners.\n \n \n \n  Hundreds of global innovators, from iconic consumer brands and tech giants to banks, retailers, and healthcare leaders turn to LiveRamp to build enduring brand and business value by deepening customer engagement and loyalty, activating new partnerships, and maximizing the value of their first-party data while staying on the forefront of rapidly evolving compliance and privacy requirements.\n \n \n   You will:\n \n \n  \n   \n    Help lead measurement initiatives; develop KPIs and learning plans for LiveRamp customers in support of their marketing objectives.\n   \n  \n   \n    Develop, implement, and maintain analytics systems, tools, and frameworks that enable efficient analysis for customers.\n   \n  \n   \n    Design approaches for observational analytics, including mining multi-dimensional datasets, and experimental methods to build templates and libraries of analysis that can scale across various customer use cases and verticals.\n   \n  \n   \n    Consult and advise clients and internal teams on audience strategy, experimental design, data requirements gathering, and post-campaign measurement using statistical and mathematical concepts to drive business solutions and actionable recommendations.\n   \n  \n   \n    Get hands-on with customer data to drive insights, answer key business questions, and enable campaign optimization.\n   \n  \n   \n    Create compelling presentations and effectively communicate complex analytical concepts to business and technical audiences.\n   \n  \n   \n    Speak and present both internally and externally, leveraging data to tell a story.\n   \n  \n   \n    Build up a strong understanding and expert knowledge of the various data sources brought together for data enrichment and collaboration.\n   \n  \n   \n    Work directly with customer stakeholders to gather requirements, communicate updates and findings, and build relationships.\n   \n \n \n \n  Your team will:\n \n \n  \n   \n    Work closely with product and engineering teams to support and understand the cloud infrastructure that runs the models.\n   \n  \n   \n    Dive deep with internal and external clients to understand their measurement and analytical needs and translate them into product improvements.\n   \n  \n   \n    Help design new offerings in the analytical space.\n   \n \n \n \n  About you:\n \n \n  \n   \n    Bachelors with 3+ years of experience or Masters with 1+ years of experience.\n   \n  \n   \n    Strong command of probability and statistics.\n   \n  \n   \n    Fluency in data and statistical analysis using SQL and Python.\n   \n  \n   \n    Strong command of data science toolkits (Pandas, NumPy, scikit-learn, etc.)\n   \n  \n   \n    Understanding of cloud platforms (AWS, GCP, etc.) and relational databases.\n   \n  \n   \n    Strong problem-solving skills.\n   \n  \n   \n    Attention to detail and time management, producing high quality, client-ready analytic deliverables across multiple projects and client engagements.\n   \n  \n   \n    Experience with ad-tech or curious about the ad-tech market and related measurement.\n   \n  \n   \n    Comfortable adapting to the latest tools and curious to explore industry best practices.\n   \n  \n   \n    Strong oral and written communication and organizational skills.\n   \n \n \n \n  Preferred Skills:\n \n \n  \n   \n    Familiarity with fundamentals of randomized-controlled trials, A/B testing, and mar-tech/ad-tech measurement.\n   \n  \n   \n    Excellent communication skills - the ability to work cross functionally, with internal and external stakeholders, to translate product requests into features and analysis into business objectives.\n   \n  \n   \n    Strong understanding of large-scale data analysis, fine-tuning of Spark jobs, and optimizing Spark SQL/PySpark models.\n   \n  \n   \n    Knowledge of Business Intelligence tools to build visualizations.\n   \n  \n   \n    High EQ.\n   \n \n \n \n  The approximate annual base compensation range is $124,000 to $155,000. The actual offer, reflecting the total compensation package and benefits, will be determined by a number of factors including the applicant's experience, knowledge, skills, and abilities, geography, as well as internal equity among our team.\n \n \n   Benefits:\n \n \n  \n   \n    People: Work with talented, collaborative, and friendly people who love what they do.\n   \n  \n   \n    Fun: We host in-person and virtual events such as game nights, happy hours, camping trips, and sports leagues.\n   \n  \n   \n    Work/Life Harmony: Flexible paid time off, paid holidays, options for working from home, and paid parental leave.\n   \n  \n   \n    Comprehensive Benefits Package: LiveRamp offers a comprehensive benefits package designed to help you be your best self in your personal and professional lives. Our benefits package offers medical, dental, vision, life and disability, an employee assistance program, voluntary benefits as well as perks programs for your healthy lifestyle, career growth and more.\n   \n  \n   \n    Savings: Our 401K matching plan—1:1 match up to 6% of salary—helps you plan ahead. Also Employee Stock Purchase Plan - 15% discount off purchase price of LiveRamp stock (U.S. LiveRampers)\n   \n  \n   \n    RampRemote: A comprehensive office equipment and ergonomics program—we provide you with equipment and tools to be your most productive self, no matter where you're located\n   \n \n \n \n  More about us:\n \n \n \n   LiveRamp’s mission is to connect data in ways that matter, and doing so starts with our people. We know that inspired teams enlist people from a blend of backgrounds and experiences. And we know that individuals do their best when they not only bring their full selves to work but feel like they truly belong. Connecting LiveRampers to new ideas and one another is one of our guiding principles—one that informs how we hire, train, and grow our global team across nine countries and four continents. Click \n  \n   here \n  to learn more about Diversity, Inclusion, & Belonging (DIB) at LiveRamp.\n \n \n \n  LiveRamp is an affirmative action and equal opportunity employer (AA/EOE/W/M/Vet/Disabled) and does not discriminate in recruiting, hiring, training, promotion or other employment of associates or the awarding of subcontracts because of a person's race, color, sex, age, religion, national origin, protected veteran, disability, sexual orientation, gender identity, genetics or other protected status. Qualified applicants with arrest and conviction records will be considered for the position in accordance with the San Francisco Fair Chance Ordinance.\n \n \n   California residents: Please see our \n  \n   California Personnel Privacy Policy\n   for more information regarding how we collect, use, and disclose the personal information you provide during the job application process.\n \n \n   To all recruitment agencies: LiveRamp does not accept agency resumes. Please do not forward resumes to our jobs alias, LiveRamp employees or any other company location. LiveRamp is not responsible for any fees related to unsolicited resumes.\n \n",
        "url": "https://www.indeed.com/viewjob?jk=18ecdadb12917617",
        "source_url": "https://www.indeed.com/m/viewjob?jk=18ecdadb12917617&from=serp&tk=1j4d17bmpgglo81c&xkcb=SoDP67M3tNKSobAFvr0KbzkdCdPP"
      },
      {
        "title": "Early Career Data Scientist/Economist",
        "company": "EvenUp",
        "location": "San Francisco, CA",
        "description": "\n EvenUp is on a mission to close the justice gap using technology and AI. We empower personal injury lawyers and victims to get the justice they deserve. Our products enable law firms to secure faster settlements, higher payouts, and better outcomes for victims injured through no fault of their own in vehicle collisions, accidents, natural disasters, and more.\n We are one of the fastest-growing vertical SaaS companies in history, and we are just getting started. EvenUp is backed by top VCs, including Bessemer Venture Partners, Bain Capital Ventures, SignalFire, and Lightspeed. We are looking to expand our team with talented, driven, and collaborative individuals who seek to have a lasting impact. Learn more at www.evenuplaw.com.\n \n  About the team:  The Analytics team at Evenup plays a critical role in driving data-informed decision-making across the organization. We partner closely with Product, Engineering, Operations, and Executive teams to uncover insights, build scalable data solutions, and enable a culture of data-driven decision making and continuous improvement. Our team is responsible for everything from foundational data modeling and reporting to advanced analytics and forecasting.\n \n  We are looking for a curious, impact-driven early career Economist / Data Scientist to join our fast-paced, data-driven team. You’ll work at the intersection of data, economics, and strategy to drive high-impact decisions across pricing, growth, and product monetization. You will apply your expertise in causal inference, econometrics, and behavioral analysis to answer some of the most critical questions in our business, and shape the way we use economics and data science to drive long-term value.\n \n  The ideal candidate for this role may be a recent economics PhD graduate with relevant research experience, typically in computationally intensive empirical topics, as well as some exposure to data management and data science. More senior candidates are also welcome to apply.\n \n  Please Note: This is a hybrid role with the expectation of working at least 3 days a week from one of our office hubs in San Francisco or Toronto.\n  What You'll Do\n \n  Translate complex datasets into clear insights with strategic recommendations that drive measurable actions and outcomes to inform product direction and business priorities\n  Partner with Product, and Ops teams to define KPIs and lead the analytics strategy for key product areas, including causal inference, cohort analysis, retention modeling and experimentation design\n  Develop forecasts for ARR, conversion, churn, and usage using economic and behavioral data\n  Collaborate with data engineering, analytics, and product to shape best practices in experimentation, forecasting, and decision support\n \n  What We’re Looking For\n We’re looking for someone with deep expertise in both economics and applied data science with the ability to frame business questions into well-scoped analytical or modeling problems.\n \n  Graduate-level research experience on data-intense problems or 1+ years of industry experience in machine learning or economics-focused roles\n  A blend of economic theory, applied econometrics, and business skills that let you jump into a fast-paced environment and contribute from day one\n  Proven ability to identify and measure causal business impacts using appropriate statistical techniques, especially in complex or observational settings\n  Strong engineering skills with expertise in R or Python and fluency in data manipulation (SQL, Pandas) and machine learning (scikit-learn, XGBoost, Keras/Tensorflow) tools\n  An ability to identify and prioritize high-impact problems and deliver solutions that provide reasonable trade-offs between urgency and quality\n  Strong verbal and written communication skills - ability to distill complex findings from models and economic reasoning into compelling insights and communicate effectively with technical and non-technical audiences\n \n  Bonus Points\n \n  Prior full time or intern experience in SaaS or B2B subscription businesses and/or in the legal domain\n  Familiarity with experimentation platforms (e.g., Optimizely, internal tools) and BI tools (e.g., Looker, Tableau)\n \n \n  Notice to Candidates:\n EvenUp has been made aware of fraudulent job postings and unaffiliated third parties posing as our recruiting team – please know that we have no affiliation or connection to these situations. We only post open roles on our career page (evenuplaw.com/careers) or reputable job boards like our official LinkedIn or Indeed pages, and all official EvenUp recruitment emails will come from the domains @evenuplaw.com, @evenup.ai, @ext-evenuplaw.com, no-reply@ashbyhq.com or no‑reply@canditech.io email addresses.\n To ensure fairness and proper consideration, we do not accept resumes or expressions of interest via email or social media messages. If you’re interested in a role, please submit your application directly through our careers page.\n  If you receive communication from someone you believe is impersonating EvenUp, please report it to us at talent-ops-team@evenuplaw.com. Examples of fraudulent domains include “careers-evenuplaw.com” and “careers-evenuplaws.com”.\n \n  Benefits & Perks:\n As part of our total rewards package, we offer attractive benefits and perks to our employees, including:\n \n  Choice of medical, dental, and vision insurance plans for you and your family\n  Additional insurance coverage options for life, accident, or critical illness\n  Flexible paid time off, sick leave, short-term and long-term disability\n  10 US observed holidays, and Canadian statutory holidays by province\n  A home office stipend\n  401(k) for US-based employees and RRSP for Canada-based employees\n  Paid parental leave\n  A local in-person meet-up program\n  Hubs in San Francisco and Toronto\n \n  Please note the above benefits & perks are for full-time employees\n \n  EvenUp is an equal opportunity employer. We are committed to diversity and inclusion in our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.\n Compensation Range: $145K - $220K\n",
        "url": "https://www.indeed.com/viewjob?jk=8939f3193b527452",
        "source_url": "https://www.indeed.com/m/viewjob?jk=8939f3193b527452&from=serp&tk=1j4d17bmpgglo81c&xkcb=SoBS67M3tNKSobAFvr0JbzkdCdPP"
      },
      {
        "title": "Data Scientist",
        "company": "Gap Inc.",
        "location": "San Francisco, CA 94105",
        "description": "\n About Gap Inc.\n Our brands bridge the gaps we see in the world. Old Navy democratizes style to ensure everyone has access to quality fashion at every price point. Athleta unleashes the potential of every woman, regardless of body size, age or ethnicity. Banana Republic believes in sustainable luxury for all. And Gap inspires the world to bring individuality to modern, responsibly made essentials.\n This simple idea—that we all deserve to belong, and on our own terms—is core to who we are as a company and how we make decisions. Our team is made up of thousands of people across the globe who take risks, think big, and do good for our customers, communities, and the planet. Ready to learn fast, create with audacity and lead boldly? Join our team.\n  About the Role\n As a Data Scientist for the Analytics and Customer Data Science team at Gap Inc, you will be part of is a highly visible team bringing direct impact to senior leaders across our four iconic brands: Old Navy, Gap, Bana Republic and Athleta. You will play a pivotal role in leveraging advanced analytics to drive growth, optimize customer experience and enhance operational excellence across Gap Inc brands. This team is chartered with spearheading data-driven initiatives that address the most important and timely opportunities to the Business, empowering leadership to make informed decisions in areas having the highest impact on financial performance and long-term customer equity.   You will be among of team of diverse talent who together, focus on delivering a portfolio of predictive and descriptive analyses while driving a customer-first mindset across business units. You bring a strong analytical mindset, passion for storytelling and skill at leveraging a broad array of internal and external data sources to influence business decisions with data. To this end, you are highly proficient at digesting and transforming complex, large scale data, and are eager to be a part of a digital-first, growth-oriented, data-driven team. Key areas of opportunity include multi-channel customer lifetime value, acquisition and retention efficiency and product analytics.\n  What You'll Do\n \n  Listen to business stakeholders, and translate needs into opportunities to generate insights, test and/or improve the customer experience.\n  Perform data analyses to quantify and monitor customer metrics and trends to help Brand Leadership better understand the customer and drive customer-centric decision making.\n  Streamline operational delivery for key reporting deliverables.\n  Assemble customer, product, financial, transactional and site browse data from multiple large-scale on-prem and cloud-based data systems using SQL and appropriate data science packages. Provide actionable recommendations and package for business consumption.\n  Develop and track customer segmentations, customer behavioral KPIs by evolving key performance and strategic business dashboards and reporting.\n  Collaborate with cross brand and cross-functional Decision Support team members to stay current on team initiatives and identify opportunities to contribute to the larger team.\n  Continually learn about Gap Inc.’s data, systems and capabilities to continually improve your impact, influence and data storytelling skills.\n \n  Who You Are\n \n  Analytically minded with strong business acumen and excited for a role that requires you to combine the two\n  1+ years of experience an analytics role, with at least one year in a business setting, preferably with a multi-channel retailer, or in a management/internal consulting role where analytics is a central area of focus\n  Proficient in using SQL for analysis of large customer and transactional datasets; other languages, such as R, Python or SAS, a plus\n  Strong business acumen, and superior written, verbal skills\n  Adept at drawing insights, visualizing results and curating client-facing presentation materials\n  Passionate about retail, customer experience, and digital marketing\n  Exposure to building data visualizations, business intelligence tools. Ex: Tableau, PBI.\n  Curious, life-long learner, self-motivated and able to work independently or as part of a team.\n  Bachelor’s degree in Statistics, Economics, Analytics, Data Science or other quantitative field required. MS degree preferred.\n \n  Benefits at Gap Inc.\n \n  Merchandise discount for our brands: 50% off regular-priced merchandise at Old Navy, Gap, Banana Republic and Athleta, and 30% off at Outlet for all employees.\n  One of the most competitive Paid Time Off plans in the industry.*\n  Employees can take up to five “on the clock” hours each month to volunteer at a charity of their choice.*\n  Extensive 401(k) plan with company matching for contributions up to four percent of an employee’s base pay.*\n  Employee stock purchase plan.*\n  Medical, dental, vision and life insurance.*\n  See more of the benefits we offer.\n \n \n  For eligible employees\n \n Gap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. We have received numerous awards for our long-held commitment to equality and will continue to foster a diverse and inclusive environment of belonging. In 2022, we were recognized by Forbes as one of the World's Best Employers and one of the Best Employers for Diversity.  Salary Range: $121,900 - $161,600 USD Employee pay will vary based on factors such as qualifications, experience, skill level, competencies and work location. We will meet minimum wage or minimum of the pay range (whichever is higher) based on city, county and state requirements.\n",
        "url": "https://www.indeed.com/viewjob?jk=680e50f7e41cbaff",
        "source_url": "https://www.indeed.com/m/viewjob?jk=680e50f7e41cbaff&from=serp&tk=1j4d17bmpgglo81c&xkcb=SoDm67M3tNKSobAFvr0IbzkdCdPP"
      },
      {
        "title": "AI and LLM Lead",
        "company": "Prologis",
        "location": "San Francisco, CA",
        "description": "\n At Prologis, we don’t just lead the industry—we define it with a 1.3 billion square foot portfolio and an annual throughput of approximately $3.2 trillion. We create the intelligent infrastructure that powers global commerce, seamlessly connecting the digital and physical worlds. From agile supply chains to energy solutions, our ecosystems help your business move faster, operate smarter and grow sustainably. With unmatched scale, innovation and expertise, Prologis is a category of one—not just shaping the future of logistics but building what comes next.\n \n \n  Job Title:\n  AI and LLM Lead\n \n \n  Company:\n \n \n  Prologis\n \n \n \n  A day in the life\n \n \n \n  We are seeking a highly motivated and strategic AI & LLM Lead to join our data science team. This individual will be responsible for identifying, designing, and executing AI-driven solutions, with a strong focus on leveraging large language models (LLMs) and generative AI to create transformative applications across business units. This role is ideal for someone who combines deep technical expertise with strong business acumen, and who thrives on building from 0 to 1.\n \n \n \n  Key Responsibilities Include\n \n \n  Business Use Case Translation: Collaborate with business leaders to translate strategic goals into AI opportunities. Engage with functional leads to clarify requirements, convert them into analytical hypotheses, rapidly prototype and iterate solutions.\n  Lead AI Project Lifecycle: Own the end-to-end process from ideation and stakeholder engagement to deployment and post-launch evaluation of AI and LLM initiatives.\n  Model Development & Deployment: Execute the full data-science workflow—including EDA, feature engineering, model selection, validation, and monitoring—adhering to team coding and documentation standards.\n  LLM Application Development: Design and implement LLM powered applications, tailored to solve real estate-specific challenges (e.g., lease abstraction, tenant communication, investment memo summarization). Craft prompts, fine-tune domain-specific models, or create retrieval-augmented generation pipelines that boost productivity or customer experience.\n  Deployment & Monitoring: Work with MLOps and engineering teams to deploy models into production environments, establish monitoring frameworks, and continuously improve solution performance.\n  Cross-Functional Collaboration: Act as a bridge between product, engineering, data, and business teams to align AI solutions with user needs and technical feasibility.\n  Insight Communication: Distill findings into clear narratives and visualizations; present recommendations to technical and non-technical stakeholders.\n  Technical Guidance: Provide peer mentorship, code and architecture reviews, and technical best practices to elevate the broader team’s capabilities\n  Continuous Improvement: Stay current on emerging algorithms and tooling; propose POCs that can raise model accuracy, reduce latency, or lower cost.\n \n \n \n  Building blocks for success\n \n \n \n  Preferred\n \n \n  3+ years of hands-on experience in applied AI/ML development (1-2 years with advanced STEM degree), with at least 2 years focusing on LLMs or NLP-related technologies.\n  Demonstrated ability to convert business questions into deployable ML solutions and explain results to non-experts.\n  Proven success owning and delivering cross-functional AI/LLM projects from start to finish.\n  Experience working in or supporting real estate, logistics, finance, or other asset-heavy industries is a plus.\n \n \n \n  Technical Skills\n \n \n  Proficient in Python (pandas, scikit-learn, PyTorch/TensorFlow, Langchain etc), SQL, and version control.\n  Solid grounding in supervised, unsupervised, and deep learning techniques plus model-evaluation best practices.\n  Hands-on experience fine-tuning or integrating LLMs such as GPT, LLaMA, Claude, Gemini, etc.\n  Experience with vector databases (e.g., FAISS, Pinecone), embeddings, and RAG architectures.\n  Solid understanding of cloud platforms (AWS, Azure, GCP) and MLOps tools.\n \n \n \n  Hiring Salary Range of: $135,000 - $190,000. Salary and whole compensation package (bonus target) to be determined by the candidate’s location, education, experience, knowledge, skills, and abilities, as well as internal equity and alignment with market data.\n \n \n \n  People First\n \n \n  Each of us working at Prologis plays an essential role in the enduring success of our company. We value people who are decisive, courageous and adaptable. While we are one company, locations and departments operate with autonomy and accountability. Individuals take the initiative here.\n \n \n \n  When you join Prologis, you work shoulder to shoulder with some of the top talent in the industry to do the best work of your career. Every employee belongs. Every employee contributes. Employees advance their careers here.\n \n \n \n  As a successful global enterprise, Prologis has never lost sight of what matters most, our strong belief that our people are the most important part of our business. And because of that, we provide a generous total rewards package and take a lot of time to focus on quality management and leadership development. People come first here.\n \n \n \n  All full-time roles in the US come with a robust benefits package which includes healthcare, dental, and vision insurance for employees and eligible dependents. Prologis also offers several other wellness, financial, and work/lifestyle-specific benefits. Our 401(k) retirement plan has a company match of 50% up to 12% of eligible compensation. We also offer generous PTO with a starting accrual of 22 days a year in addition to paid holidays and volunteer time.\n \n  All job offers are contingent upon successful completion of background verification. Prologis is an Equal Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religions, sex, national origin, sexual orientation, gender identity, disability status, protected veteran status, or any other characteristic protected by law.\n \n \n  Employment Type:\n  Full time\n \n \n  Location:\n  San Francisco, California\n \n \n  Additional Locations:\n  Cerritos, California, Denver, Colorado, Milpitas, California, Newport Beach Office, Ontario, California, Toronto, Ontario, Canada\n",
        "url": "https://www.indeed.com/viewjob?jk=f43d1d822cb4e247",
        "source_url": "https://www.indeed.com/m/viewjob?jk=f43d1d822cb4e247&from=serp&tk=1j4d17bmpgglo81c&advn=2893638315671387&adid=424863524&ad=-6NYlbfkN0DBm4QtmS_tO7F4ExG9Ds5f5nsu4-9nFZ9K27uUwc6si538yrBATtp1bRE9AYC4i17-8vyHHQkQvldHi_T3MqpZKt-Y5ECUqAVoYJhBv5C7UOVYp82_UEQJ_DcZ1hHpkuUY0ul6xXvsp-FR89wBu3iF_dPLKaG_0YFovHAeZ9CSFCBkTvr-ZX2nDhjPGS0iO-UGOYawR-ZtkxrCDQsgWGDDBSNFjKTZDBRsJWqiFGBkDtQLn8Xuwz5Z1MMMshOsaS0Mk4rJp67OrN03U9OLDQQ5Rp6Z4KV9-tKbzX1feE7P4_pkr46JXAdLif6ul3le_NCqO8zbd_NVuwRqX3_FR94zLZkpKnhOpOc-1TYYoHmCsSw8RPISE-J2JhtDDbsRtQjFPGXQlB3jtKMi9BPg7roafxGCnuXNXQM8Yh-SCUz3Me9YCARQ3pQ8H2Un57wd_jrUTqNySQfwiAS95N7ATSDbdTgDCffqlwyPkA6183d-I-p3LG8o9qDnReKidvWLzAkvGcElKNMkcUm4HBZreJTPCRiR71QaCg2iUeayexLO57VZXZ8Eed1rad42oQw1aEiRulwzQUAm-Pps3d7ZTILwGABrFy6C6lYCpHcqIoc13RqZQ2AKjpW494QIZKWhIylmPu8eucGBNsTVGC2GXK9J_RIFZP9VjpZVGmE7moSAkcRy6Iw2p2Wl9e36nHuYJvpylbZFQzqsdn3mAVqwLsWOgdN5xDQcRqtaHW98gFvR4s73ioUXj0UorWJExCvHuL7lY57xHU6IzbDw38d91Pt_JmpMY9MSshzdloINCjZjYA%3D%3D&xkcb=SoCc6_M3tNKSobAFvr0PbzkdCdPP"
      },
      {
        "title": "Principal Machine Learning Engineer - Ad Platforms",
        "company": "Disney Entertainment and ESPN Product & Technology",
        "location": "San Francisco, CA 94105",
        "description": "\n Technology is at the heart of Disney’s past, present, and future. Disney Entertainment and ESPN Product & Technology is a global organization of engineers, product developers, designers, technologists, data scientists, and more – all working to build and advance the technological backbone for Disney’s media business globally.\n \n The team marries technology with creativity to build world-class products, enhance storytelling, and drive velocity, innovation, and scalability for our businesses. We are Storytellers and Innovators. Creators and Builders. Entertainers and Engineers. We work with every part of The Walt Disney Company’s media portfolio to advance the technological foundation and consumer media touch points serving millions of people around the world.\n Here are a few reasons why we think you’d love working here:\n \n   Building the future of Disney’s media: Our Technologists are designing and building the products and platforms that will power our media, advertising, and distribution businesses for years to come.\n   Reach, Scale & Impact: More than ever, Disney’s technology and products serve as a signature doorway for fans' connections with the company’s brands and stories. Disney+. Hulu. ESPN. ABC. ABC News…and many more. These products and brands – and the unmatched stories, storytellers, and events they carry – matter to millions of people globally.\n   Innovation: We develop and implement groundbreaking products and techniques that shape industry norms, and solve complex and distinctive technical problems.\n \n \n Ad Platforms is responsible for Disney’s industry-leading ad technology and products – driving advertising performance, innovation, and value in Disney’s sports, news, and entertainment content, across all media platforms.\n \n The Ad Platform research team is under Ad Platforms and its mission is to transform advertising and Disney's Ad platform with AI and data science. We build solutions to measure and optimize every aspect of the advertising life cycle. Our tenant is a strong cross-domain team to deliver E2E solutions for machine learning and data science. Our team is seeking a principal machine learning engineer who will be an outstanding addition and leading development for prediction or optimization engines for addressable ad platforms. The right person for this role should be experienced in crafting implementation for either machine learning technologies or data-driven algorithms. If you are someone who is proactive, inquisitive, and innovative in these domains, this is a phenomenal role for you!\n \n  WHAT YOU’LL DO\n \n  Drive design and implementation of LLM and GenAI related applications\n  Provide Prompt Engineering support to different functional team\n  Drive ground-breaking innovation and apply state of the art AI and machine learning in a variety of areas to enhance every aspect of advertising, including inventory forecasting, ad experience, ad pacing, pricing, targeting, and efficient ad delivery.\n  Invent and iterate novel solutions for complex ad challenges with fast turnaround.\n  Lead the ad algorithm architecture design and iteration of the advertising system.\n  Develop and implement scalable and efficient approaches for large scale data analysis and model development.\n  Build and experiment new algorithms and models end-to-end, from production rollout to continuous optimization.\n  Collaborate with engineering teams, product managers, and program managers in an open and creative environment.\\\n  Mentor team members and support their technical growth.\n \n \n  WHAT TO BRING\n \n  Bachelor's degree in computer science or equivalent experience\n  At least 10 years of working experience on large scale machine learning at leading internet companies. Experience in the advertising domain is preferred. Experience with forecasting algorithm is preferred.\n  Strong knowledge of AI/ML technologies, mathematics and statistics.\n  Ability to collaborate with and lead projects across cross-functional teams such as Product Management, Architecture, and other Engineering teams\n  Passionate about understanding the ad business, applying advanced research to relevant business scenarios, and seeking innovation opportunities to enhance business effectiveness.\n  Passionate about technology, open to interdisciplinary collaborations, and experienced in building data-driven services and applications.\n  A proven track record of thriving in a fast-paced, data-driven, and collaborative work environment is required.\n \n \n  NICE-TO-HAVES\n \n  MS or PhD in computer science or equivalent experience\n  Experience in AWS Bedrock, OpenAI Model on Azure\n  Experience in the advertising domain is preferred\n  Experience in large scale machine learning\n  Experience in LLM and GenAI\n  Experience in digital video advertising or digital marketing domain\n  Experience with Tensorflow, Kubeflow or Sagemaker\n \n \n  ADDITIONAL INFORMATION\n #DISNEYTECH The hiring range for this position in San Francisco, CA is $222,200 - $297,900 per year and in Seattle, WA is $212,600 - $285,100 per year. The base pay actually offered will take into account internal equity and also may vary depending on the candidate’s geographic region, job-related knowledge, skills, and experience among other factors. A bonus and/or long-term incentive units may be provided as part of the compensation package, in addition to the full range of medical, financial, and/or other benefits, dependent on the level and position offered.\n",
        "url": "https://www.indeed.com/viewjob?jk=90e757b1d329589e",
        "source_url": "https://www.indeed.com/m/viewjob?jk=90e757b1d329589e&from=serp&tk=1j4d17bmpgglo81c&advn=5263280023494940&adid=416596641&ad=-6NYlbfkN0DAFTyt7pbDCC2JPO79CSdi1dIb81yjczP5qsKcZIxgiSx9pTtqkYYdWRNbz8s1sRyfkgt7W5nlEe8KkASp2VKIBBhobcHWS8Jl13mFh4doLjvYwzTHyEYULtrp-dPUlw7T9aNahlXqrLTiM2JST7qpZjY6WlyxZQx0rBL6u7rcwXYUW85hcwp-lw3psAKDoTl_rT81pAJ7NnIETwGlgIDv_C0Xj4sw6dl43FTgcR0D6kjQr-9RPSo5Uj7UHnS3ptzyXEzBT1s066VRXR0OZOumhWPOpQhASDPZD4MRDSKfHOQBFIRlipdL8tlfKs0Izuqjgc_IdHbvhuyQvtQf8dq3MFOP9xtG7uAdx3N--SFuwy46E5fdedjy9mh6Kd8-MeRpOCjVV749-ObZ7sWePpYJF5R5JfD_P__38mTbuOeWyBbeZpAyfI8gBhJ4WelfBbRbhRAjCcLtoQy-md6eSY_tdsUqrRQEzJq6eyONZwyPwhrXiQyerdZblqbiQa7dIxKZU0EVtxzrJYw4FXbimZ3a5kkP9yO-HJbhAsOelGfN2sywv9ZpXJ9HWCyIEz0qIGThWlnGZ2_VU0JTh_YV5c06q069cnPV40sShxMw9hrSHefg-t3znE4EUUtScyWTMkyhznLXXiIfYPcPUcP6pcFOUfpKV4jSJCzTJmU--YEKV4w7q-ZK9dvsK0SONd345_ZApw9GqyZTTXychDOzn8mKdBAz6-xSKG6gjvef_3CTehVvi_I7h6B7-PmStWcRWFkDUrVH7dKVUKsMEtgMYf1CFLd1HUxKjfnZqNUSELd9ayTtA8L8tGIKsMXDdq7wX2PR3Qcqu3RYFSD81l2HfWsbT58PdkLzDWcsLrnwTpkeq0SVS2CXKwRTXcqlPHKGXnY%3D&xkcb=SoAo6_M3tNKSobAFvr0ObzkdCdPP"
      },
      {
        "title": "Full Stack Engineer - AI Trainer",
        "company": "DataAnnotation",
        "location": "Berkeley, CA",
        "description": "Join the DataAnnotation team and contribute to developing cutting-edge AI systems, while enjoying the flexibility of remote work and setting your own schedule.\nWe are looking for a proficient Full Stack Engineer to help advance AI development. As a member of DataAnnotation’s coding team, you’ll be part of a growing community of over 100,000 professionals — including front-end, back-end, full-stack, machine learning, and other engineers — who are driving real-world impact in AI development.\nOur platform offers an engaging blend of flexibility and challenge: you’ll work closely with state-of the art AI models to take on programming tasks that include creating and solving challenging coding problems, building beautiful apps with rich functionality, and synthesizing insights through data analysis and visualization. Your work directly contributes to refining intelligent systems that learn, adapt, and evolve. Some team members fit this work alongside a full-time role, while others treat it as their primary focus, choosing projects and schedules that align with their availability and goals.\nTo get started, once you sign up for an account, you'll take a short assessment (this serves as our version of an interview). If you pass that assessment, you’ll receive an email confirmation, and paid work will become available to you through our platform.\nBenefits:\n\n Fully remote: work from anywhere in the US, Canada, UK, Ireland, Australia, and New Zealand.\n Flexible schedule: choose which projects you take on and when you work.\n Competitive pay: projects are paid hourly, starting at $40+ USD per hour. Opportunities for higher-paying projects are available with strong performance.\n Impact: help shape the future of AI technologies.\n\nResponsibilities:\n\n Design and solve diverse coding problems used to train AI systems.\n Write clear, high-quality code snippets and detailed explanations.\n Evaluate AI-generated code for accuracy, performance, and clarity.\n Provide feedback that directly shapes the next generation of AI models.\n\nQualifications:\n\n Fluency in English (native or bilingual level).\n Proficiency in at least one of the following programming languages or frameworks: JavaScript, TypeScript, Python, C, C#, C++, React, Go, Java, Kotlin, or Swift.\n Excellent writing and grammar skills.\n A bachelor’s degree (completed or in progress).\n Previous experience as a Software Developer, Coder, Software Engineer, or Programmer is preferred.\n\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, Canada, UK, Ireland, Australia, and New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.\n#INDUSSD\nJob Type: Contract\nPay: From $40.00 per hour\nBenefits:\n\n Flexible schedule\n\nWork Location: Remote",
        "url": "https://www.indeed.com/viewjob?jk=c4794abd58c91e4d",
        "source_url": "https://www.indeed.com/m/viewjob?jk=c4794abd58c91e4d&from=serp&tk=1j4d17bmpgglo81c&advn=7831672186689475&adid=450586873&ad=-6NYlbfkN0CnM4TERr6XuVBW3VTRACvDXDx9S3Pbn6a0SwhkmoLTiJ7-WtU1cq8uaFimlSCTv0_bFSXQRJbF0NG6ohsnTTyrNj9JCZf9EC_iuNAY-eRpGhniQAX-X6Pp4guJnxyFQiFeaq5a_3LUF2sRux8_85aL3tMrRhhZ_CxByVYOOcWK2Z8ms2RnPFhFKhUjZQ968Ch6S3GpDK5O-ctKl9tDKVGmk4ng7JXMs0sOXtBMUcgpWkV-oLxeWwI-lwCJtde_IMrgFQTkI2ZV8qAsDbBu9vbmFVF2NnTiFcP5esSfluzscNJh570r1Edzu-OjxP-kiwylEpeAy3mrajNj-isHxRiUA92pISR0_6uVKNc0hMbChKoIhAQpcnLqZ7OTV8T9WwbUppFgfkuP4j3sGpamv6C4Ph77cohvVtdTXGdyjmjNS2ZXgCX13NfENaqhrUkw53cO1_ho9g-32AmF3pq3vg66llsvWSnS1FwB3j7Z32ea0F_w3wmP4MJJpHDTP2Eq0owwqf6xfVst3oHcraOb8VQlprxHzL3EA-wI7bPKcCw6VDGT54PCvFlSAdO-q66gYpB8ZFZfEsbhiw5zq5AHfGzBYruuyilOqO1HMaod5B4J2grbjEvTyGl_UGrLnIBjxM8lRLYB_hrM-2xSM43iJPwF0_q8uxujfKlS6hI7IlRW7h0CUd58ztt9kIT009c_71VrCZiHtOxZZ1Sn4uvyv3uM8ynfeD9_NgfITbuvZuD-3ZfqBOBNlkyxadPCfO62REfd8M4zgdwVNtN1pwut_1SG5fHItHBDK5acVNLu1HkyCFHQ_9gdbm_FjS_iEqQ191UCnmdQHRW27sPwxnwkDt0BStXXLJ8iu6IqERuOURY1fe0x32YguSARGqNlKQ30WHHgOtOBRiv32se-HZ8BtuDxlLm25R8LC7e_I1I6m9FfAu39CQWO-Rx3&xkcb=SoC16_M3tNKSobAFvr0NbzkdCdPP"
      },
      {
        "title": "Data Scientist",
        "company": "Abbott Laboratories",
        "location": "Alameda, CA 94501",
        "description": "\n Abbott is a global healthcare leader that helps people live more fully at all stages of life. Our portfolio of life-changing technologies spans the spectrum of healthcare, with leading businesses and products in diagnostics, medical devices, nutritionals and branded generic medicines. Our 114,000 colleagues serve people in more than 160 countries.\n  Working at Abbott\n At Abbott, you can do work that matters, grow, and learn, care for yourself and family, be your true self and live a full life. You’ll also have access to:\n \n  Career development with an international company where you can grow the career you dream of.\n  Free medical coverage for employees* via the Health Investment Plan (HIP) PPO\n  An excellent retirement savings plan with high employer contribution\n  Tuition reimbursement, the Freedom 2 Save student debt program and FreeU education benefit - an affordable and convenient path to getting a bachelor’s degree.\n  A company recognized as a great place to work in dozens of countries around the world and named one of the most admired companies in the world by Fortune.\n  A company that is recognized as one of the best big companies to work for as well as a best place to work for diversity, working mothers, female executives, and scientists.\n \n  The Opportunity \n As a senior Data Scientist, you will be challenged to bridge data analysis and innovation to help people with diabetes (PWDs) and their health care providers to better manage their diabetic conditions and progression. You will be given the opportunity to apply your knowledge in statistical methods, machine learning, and signal processing to analyze patient health data (such as Continuous Glucose Monitoring data) and develop solutions to provide therapy and lifestyle guidance. The ideal candidate will be able to analyze data quickly and effectively from multiple sources and translate their findings into clear, actionable insights. Candidates should have strong skills in Python, MATLAB, or similar high level programming language. Previous work in within the medical device space is also highly preferred.\n \n  What you’ll work on\n \n  Lead analysis of data from various sources (glucose monitors, connected medication delivery devices, patient entered data, electronic medical records) to uncover patterns, anomalies, and gaps in the existing solutions, and formulate hypotheses about potential unmet needs\n  Present findings to stakeholders\n  Collaborate with domain experts (e.g., clinicians) to understand current challenges\n  Lead development of proof-of-concept solutions based on insights gathered from data and experts\n  Conduct literature reviews and competitive analyses to identify what has already been addressed and what hasn’t.\n  Understand the product vision and propose research directions based on the vision\n \n \n  Required Qualifications\n \n  BS in engineering or physical science or related field or equivalent. MS degree ideal.\n  6 yrs advanced data analysis of clinical or real-world evidence data in either a medical device or pharmaceutical setting.\n  Experience credit for advanced degrees beyond BS (2 years for Masters; 4 years for Doctorate).\n  Experience in one or more of the following areas: statistical analysis, machine learning algorithms, signal processing, physiology modeling and simulation.\n  Experience with Python, MATLAB, or similar programming language.\n \n \n  Preferred Qualifications\n \n  Advanced degree (Master’s or Doctorate) in an engineering domain\n  Experience with SQL, Databricks, AWS/Azure, or similar big data processing tools\n  Experience utilizing machine learning techniques for problem solving.\n  Understanding of the diabetes space from disease etiology and pathogenesis through on-market devices and therapeutics is not required, but highly beneficial.\n  Experience in medical device industry.\n \n  What We Offer\n At Abbott, you can have a good job that can grow into a great career. We offer:\n \n   Training and career development, with onboarding programs for new employees and tuition assistance\n   Financial security through competitive compensation, incentives and retirement plans\n   Health care and well-being programs including medical, dental, vision, wellness and occupational health programs\n   Paid time off\n   401(k) retirement savings with a generous company match\n   The stability of a company with a record of strong financial performance and history of being actively involved in local communities\n \n  Learn more about our benefits that add real value to your life to help you live fully: www.abbottbenefits.com\n Follow your career aspirations to Abbott for diverse opportunities with a company that provides the growth and strength to build your future. Abbott is an Equal Opportunity Employer, committed to employee diversity.\n Connect with us at www.abbott.com, on Facebook at www.facebook.com/Abbott and on Twitter @AbbottNews and @AbbottGlobal.\n \n  The base pay for this position is $112,000.00 – $224,000.00. In specific locations, the pay range may vary from the range posted.\n",
        "url": "https://www.indeed.com/viewjob?jk=96e61ee31ecc8671",
        "source_url": "https://www.indeed.com/m/viewjob?jk=96e61ee31ecc8671&from=serp&tk=1j4d17bmpgglo81c&advn=7678523876649298&adid=414673198&ad=-6NYlbfkN0C2ZFwvvDqMqUSd2oyW6lCV3jOgG1gOU5u1NExha-d6nF0wf8tb-UVFizSAU2Z_0c09dp43wZXacyAhJO53TaVGm7s0DZa9HNfoRtoAiTbC7-SoUm6ZQ0-WryTcD0RlRMiEZTZBCbjwDcMn1F3cnoLzSVcuGQwNlkEqFqO6cRXnErwBxZNUjr9B2yl6fFnl2ef9KEFuTo34gpBKKdekyQBxIP-hvdDva2bhYMnVRPc-I1xCSmyfFSc-kR-2zkd9UrlGa-jor9s6C4_rD08ju2NrpVewqT98iNTL3XatM6ogm0-Y-vXzui5yRWJ-_sADVGGw95KVHFFnyN_EWVeDZzGmBpBy6YvXtu_-ohXlYwj72TjGU0rqluA1qBKHy7uf2DPzDYGATEWyKcgumxFzZEjf7hIVhWi3s-S8HjjTRc-mN0ZV9LE5nOSevIgNadRS9fYQA_2ag1-6jyFKj2QZz0LVr_HQtPW10PyoCEzY0YPL9mRgIxCgFYgAOl0Wo62oLE5z1F_NkAgmhCiDNfXHjovbrne_7iJBXcErWwsSDM1hoatetrhy4gvBeL39Dca9eq9yjE88-izIi5IHealsda88GZ2J4JLvcTibsCRFqrurTK1wRWpI9D9C3unoBxVIixQ7OiA2fgmagGCWn6wjkIm4LPNhK-TriAg2Md9G1LL0zw5j9Bx5CbGkbNVvG_-GtOJBjbC6dF4IrpxM_BnKt7Jt9ANYemS6zyE%3D&xkcb=SoAB6_M3tNKSobAFvr0MbzkdCdPP"
      },
      {
        "title": "Full Stack Engineer - AI Trainer",
        "company": "DataAnnotation",
        "location": "San Francisco, CA",
        "description": "Join the DataAnnotation team and contribute to developing cutting-edge AI systems, while enjoying the flexibility of remote work and setting your own schedule.\nWe are looking for a proficient Full Stack Engineer to help advance AI development. As a member of DataAnnotation’s coding team, you’ll be part of a growing community of over 100,000 professionals — including front-end, back-end, full-stack, machine learning, and other engineers — who are driving real-world impact in AI development.\nOur platform offers an engaging blend of flexibility and challenge: you’ll work closely with state-of the art AI models to take on programming tasks that include creating and solving challenging coding problems, building beautiful apps with rich functionality, and synthesizing insights through data analysis and visualization. Your work directly contributes to refining intelligent systems that learn, adapt, and evolve. Some team members fit this work alongside a full-time role, while others treat it as their primary focus, choosing projects and schedules that align with their availability and goals.\nTo get started, once you sign up for an account, you'll take a short assessment (this serves as our version of an interview). If you pass that assessment, you’ll receive an email confirmation, and paid work will become available to you through our platform.\nBenefits:\n\n Fully remote: work from anywhere in the US, Canada, UK, Ireland, Australia, and New Zealand.\n Flexible schedule: choose which projects you take on and when you work.\n Competitive pay: projects are paid hourly, starting at $40+ USD per hour. Opportunities for higher-paying projects are available with strong performance.\n Impact: help shape the future of AI technologies.\n\nResponsibilities:\n\n Design and solve diverse coding problems used to train AI systems.\n Write clear, high-quality code snippets and detailed explanations.\n Evaluate AI-generated code for accuracy, performance, and clarity.\n Provide feedback that directly shapes the next generation of AI models.\n\nQualifications:\n\n Fluency in English (native or bilingual level).\n Proficiency in at least one of the following programming languages or frameworks: JavaScript, TypeScript, Python, C, C#, C++, React, Go, Java, Kotlin, or Swift.\n Excellent writing and grammar skills.\n A bachelor’s degree (completed or in progress).\n Previous experience as a Software Developer, Coder, Software Engineer, or Programmer is preferred.\n\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, Canada, UK, Ireland, Australia, and New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.\n#INDUSSD\nJob Type: Contract\nPay: From $40.00 per hour\nBenefits:\n\n Flexible schedule\n\nWork Location: Remote",
        "url": "https://www.indeed.com/viewjob?jk=7459a0b262fc9f0d",
        "source_url": "https://www.indeed.com/m/viewjob?jk=7459a0b262fc9f0d&from=serp&tk=1j4d17bmpgglo81c&advn=7831672186689475&adid=450586873&ad=-6NYlbfkN0CnM4TERr6XuVBW3VTRACvDXDx9S3Pbn6a0SwhkmoLTiJ7-WtU1cq8uaFimlSCTv0_bFSXQRJbF0DwfQ1kEG5jxTKL-oqbADo7ilZHblwTjhU16MemKiRW5qOe93tQssoZVzP7Pd4XumSATvhKk-t8vTjPcjEw3zGzLcVg17JPCkQ8d1vw8lLJZLqsYOD_jgEBdt4yjZxOzTpdBBsjY9LlPoJ637-GDrfPTm498-OTici1D_9ZJSZxuUloLyOty7a-XaEnOkIfINwql_CpX0ngSYPNHKuR6VPAQr0vwivW_z0SPIz_bXrJG5cpL_zdgKMh4Mpi74WBI4x1FriKnYbkils1_aGj6KYPkpsWwd9K23Nl-HxGoMMlzCQMjSQx9QaqugXOrJ-2x5aD1y4Y3qrp3VITvnFbgyhTJDzzvNSYUE6DCtW2AFP4ET-1jykcnES85LTbBW3T-yQwGEtPlSgRKqqqqOIm2RiwzcVvEBzrzQUu8b7bN1vHATm964tQwYv-jlspdBKx-BbJV9qw-g28yuTohh7gdsZWcjvXqioVN5K427u77XAQajI4S3uGFAfcskhpaRoKu3q3gJ7HtxeYZfa0ftS_frSk9GAighvF7OpYOLhCg5bzT3OAiphX1D1Y322b4kXVRT1sNuQ47Ir8itDzp3jLN9x4wtrd2o4A7IpQWvmiZkhP590WZpWZ-nRdRmnuvo4P_JTLvW2avpZeEwjaXJUKUYvYpRcpXqXSTJXXWOyAChiAmgRh9kXtJV1MWN76XbYIkanqEp5AEuG6cES2VZdsjYEksRwXufbA89zSFGq78BblqBK5x571KuM6Q2C1--bGJQsErSl_flL12zexof7Q2WjSOONotYsR_A29SNGckcOj9Pmg0CsJKokLANiTZKZU4itsUrmwKrIDOKhGwYojVOPgJmjE7wYWIp8_a47doQ4zGlSrSWLBGpGA%3D&xkcb=SoDo6_M3tNKSobAFvr0DbzkdCdPP"
      },
      {
        "title": "Full Stack Engineer - AI Trainer",
        "company": "DataAnnotation",
        "location": "Oakland, CA",
        "description": "Join the DataAnnotation team and contribute to developing cutting-edge AI systems, while enjoying the flexibility of remote work and setting your own schedule.\nWe are looking for a proficient Full Stack Engineer to help advance AI development. As a member of DataAnnotation’s coding team, you’ll be part of a growing community of over 100,000 professionals — including front-end, back-end, full-stack, machine learning, and other engineers — who are driving real-world impact in AI development.\nOur platform offers an engaging blend of flexibility and challenge: you’ll work closely with state-of the art AI models to take on programming tasks that include creating and solving challenging coding problems, building beautiful apps with rich functionality, and synthesizing insights through data analysis and visualization. Your work directly contributes to refining intelligent systems that learn, adapt, and evolve. Some team members fit this work alongside a full-time role, while others treat it as their primary focus, choosing projects and schedules that align with their availability and goals.\nTo get started, once you sign up for an account, you'll take a short assessment (this serves as our version of an interview). If you pass that assessment, you’ll receive an email confirmation, and paid work will become available to you through our platform.\nBenefits:\n\n Fully remote: work from anywhere in the US, Canada, UK, Ireland, Australia, and New Zealand.\n Flexible schedule: choose which projects you take on and when you work.\n Competitive pay: projects are paid hourly, starting at $40+ USD per hour. Opportunities for higher-paying projects are available with strong performance.\n Impact: help shape the future of AI technologies.\n\nResponsibilities:\n\n Design and solve diverse coding problems used to train AI systems.\n Write clear, high-quality code snippets and detailed explanations.\n Evaluate AI-generated code for accuracy, performance, and clarity.\n Provide feedback that directly shapes the next generation of AI models.\n\nQualifications:\n\n Fluency in English (native or bilingual level).\n Proficiency in at least one of the following programming languages or frameworks: JavaScript, TypeScript, Python, C, C#, C++, React, Go, Java, Kotlin, or Swift.\n Excellent writing and grammar skills.\n A bachelor’s degree (completed or in progress).\n Previous experience as a Software Developer, Coder, Software Engineer, or Programmer is preferred.\n\nNote: Payment is made via PayPal. We will never ask for any money from you. PayPal will handle any currency conversions from USD. This job is only available to those in the US, Canada, UK, Ireland, Australia, and New Zealand. Those located outside of these countries will not see work or assessments available on our site at this time.\n#INDUSSD\nJob Type: Contract\nPay: From $40.00 per hour\nBenefits:\n\n Flexible schedule\n\nWork Location: Remote",
        "url": "https://www.indeed.com/viewjob?jk=c67d367b2a86e8b7",
        "source_url": "https://www.indeed.com/m/viewjob?jk=c67d367b2a86e8b7&from=serp&tk=1j4d17bmpgglo81c&advn=7831672186689475&adid=450586873&ad=-6NYlbfkN0CnM4TERr6XuVBW3VTRACvDXDx9S3Pbn6a0SwhkmoLTiJ7-WtU1cq8uaFimlSCTv0_bFSXQRJbF0CPBPfCeCVJyYdw_Cr1OBHXio9IrafJ9qQY2kNyXaxi_W19W5VlZngO9oYiduZlSbLpsDEu4brzhp_LzoxsRNTGniy-DEvA52Vm3Aw5DcxNL1vc00L5yE2PBlwmxJLIPQt7z3xCM_eNcGpmXdvJyu6TG0Hy4XqYVt1lvWKBA_JL223OoupVl2Dg5DzTA3ttPNHFys5bNoEPO3cUAktdI2QUjoPEweZI61i98IKckBd38sHF0JUozdQtLbo_ycZcGLE54TAo9Otb2TirypUf3NMjCokxInctjxGx-3C0asOGoNPmE1AYm31RqJpDvwaIvqyFwhfgppUQ_7KCWlmQ--caMEHhl5wCmahHyZ6m7Z2J7oHmmMMGFcBSLpRzIMqDlJe0z2MUwDZM0M6Qpg6fTyXMiuowCNYqsNHmKxAL4kM8lDHc7Zx5DdZix714c7JfeLL_TcWJiL4OzmgREz6SmAfMcwcUOvuiWoMt7y-UPjUn3xbpImefUSCmxs0nerbxIysK9mqM9V2FCxXXcNazrBXZebayIpaQmbtfq0uArkfmnZ4rYGPGnKNczY78zlAvGqBYIeyuqenjqcdZ98aCnUFo0RTSL__ZQFQWjxK0_kAUVfCiTTjA6q0Ey9j4KCWotGg7SONw7IK0J7rV54hBuXkx3Mgkp4Z38uneJWk-bRbrt5cLZ-lJtkaAbTIwwl-n8Hk8Ep8EGfiXc9cBJYsJOrZgVDOVAymrg7vAPDEIAkywVPX3qGMCH8pNM3We1fEX_HKjOdH8Hdlyap_zARSGsaglTK_iY5Q_nRifhswiEYDJYgm4pWBjyKWRL2zjhr6K64dDLT9sf0vfiArj5aCQGaB1LzyZxvG6alTMaRdvFVrvv&xkcb=SoBc6_M3tNKSobAFvr0CbzkdCdPP"
      }
    ]
  }
}