{
  "metadata": {
    "search_job_title": "Machine Learning Engineer_detailed",
    "search_location": "Dhaka, Bangladesh",
    "timestamp": "2025-09-05T19:52:09.975544",
    "total_jobs": 5
  },
  "data": {
    "job": [
      {
        "title": "Machine Learning Engineer",
        "company": "Kudu Dynamics",
        "location": "Chantilly, VA 20151",
        "description": "\n \n  MACHINE LEARNING ENGINEER- Job Description  Who We Are: Kudu Dynamics is a Leidos owned company, forged out of a decade of experience in computer network operations and staffed with talent who have built, overseen, and enhanced capabilities throughout the entire USG arsenal. Our team of hackers and engineers have experience spanning centuries of research, development, and\n \n \n  operations missions - across desktop, mobile, IoT, and embedded platforms. Kudu Dynamics is uniquely qualified to anticipate tomorrow’s threats and build the next generation of capabilities.\n \n \n \n  Job Description:\n \n \n  We are looking for someone to join us on a new project developing an Agentic AI architecture for cyberspace planning and operations. The role incorporates main focus areas in large language models, AI agent frameworks, AI tool development (model context protocol), and related software engineering tasks. This role will be part of a small team based at Kudu’s Virginia office looking to demonstrate capabilities to our Sponsors. The role will be filled with someone able to apply multiple skill sets and reach a prototype software deployment at the conclusion of the effort.  Responsibilities:\n \n \n  Design and deploy an AI agent architecture capable of executing high-level planning objectives defined by the Sponsor\n  Tune AI agent parameters to optimize efficiency, minimize hallucinations and looping, and ensure well-structured output\n  Integrate diverse third-party systems by developing custom MCP servers or system-specific agents\n  Coordinate with a mid-sized (20-person) software development team to embed the AI framework into an existing system\n  Analyze and interpret results, communicate findings clearly, and recommend improvements\n  Collaborate with project leads to manage technology scope and mitigate risks\n  Maintain thorough documentation for both software and infrastructure\n \n \n  Minimum Qualifications\n \n \n  Proficiency in Python for software development and testing\n  Experience integrating external APIs and databases\n  Experience with AI agent architectures, including LLM deployment\n  Hands-on experience with at least one AI agent framework (e.g., LangChain, fast-agent, CrewAI)\n \n \n  Preferred Qualifications\n \n \n  Hands-on experience with multiple AI frameworks\n  Experience deploying AI agents into production environments\n  Experience developing and deploying custom MCP servers for tool integration\n  Experience building prototype UIs using Python frameworks such as Dash, Streamlit, or Chainlit\n  Understanding of the cyberspace operations lifecycle\n \n \n  Benefits We Provide\n \n \n  Equity at a company that is doing dynamic, fun, meaningful, and interesting work.\n  A flexible work schedule, with the option to work remotely most days, if that’s your style.\n  Your own yearly discretionary budget to buy the things that make you happy.\n  In addition to highly competitive salaries, we offer premium healthcare options, 401k matching, and an annual pass to a swim in the bonus pool.\n  We also offer four weeks of paid time off and 11 federal holidays to utilize whenever you want throughout the year.\n  Awesome, enthusiastic co-workers and a company culture that promotes a jerk- free environment.\n  Rattle the windows with the company band, participate in board game or movie nights, and help balance out the scotch vs. bourbon ratio in the office.\n \n \n  Kudu provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.\n \n",
        "url": "https://www.indeed.com/viewjob?jk=688457f1c0b7e5e7",
        "source_url": "https://www.indeed.com/m/viewjob?jk=688457f1c0b7e5e7&from=serp&tk=1j4d2ba8egedm84o&xkcb=SoDM67M3tNMil_yNlx0KbzkdCdPP"
      },
      {
        "title": "Machine Learning Engineer",
        "company": "Tiger Analytics",
        "location": "Remote",
        "description": "\n Tiger Analytics is looking for experienced Machine Learning Engineers with Gen AI experience to join our fast-growing advanced analytics consulting firm. Our employees bring deep expertise in Machine Learning, Data Science, and AI. We are the trusted analytics partner for multiple Fortune 500 companies, enabling them to generate business value from data. Our business value and leadership has been recognized by various market research firms, including Forrester and Gartner.\n We are looking for top-notch talent as we continue to build the best global analytics consulting team in the world. You will be responsible for:\n \n \n  Providing solutions for the deployment, execution, validation, monitoring, and improvement of MLE solutions\n  Creating Scalable Machine Learning systems .\n  Building reusable production data pipelines for implemented machine learning models\n  Writing production-quality code and libraries that can be packaged as containers, installed and deployed\n \n \n You will collaborate with cross-functional teams and business partners and will have the opportunity to drive current and future strategy by leveraging your analytical skills as you ensure business value and communicate the results.\n  Requirements\n MLE Skillsets needed:\n \n  Good exposure to Model development and deployment\n  Experience developing API’s\n  Python based application using CICD\n  AWS or Google cloud environment experience\n \n Required Skills:\n \n  Proficiency in SQL, Python, and MLOps.\n  Experience with AWS services, including SageMaker\n  Familiarity with DevOps concepts and cloud based CI/CD tools\n  Knowledge of Snowflake and Oracle databases.\n  Experience with GitHub for version control.\n  Strong understanding of Agile methodologies.\n \n Preferred Qualifications:\n \n  Passion for learning and staying updated with new technologies.\n  Persistent and proactive approach to problem-solving.\n  Strong analytical mindset.\n  Knowledge of the insurance industry is a plus.\n  Exposure to GenAI and LLMOps(Large Language Model Operations) a differentiator, but not required.\n \n \n  Benefits\n This position offers an excellent opportunity for significant career development in a fast-growing and challenging entrepreneurial environment with a high degree of individual responsibility.\n\n",
        "url": "https://www.indeed.com/viewjob?jk=c5d5de6d33a6a09b",
        "source_url": "https://www.indeed.com/m/viewjob?jk=c5d5de6d33a6a09b&from=serp&tk=1j4d2ba8egedm84o&xkcb=SoBR67M3tNMil_yNlx0JbzkdCdPP"
      },
      {
        "title": "Machine Learning Engineer (Contract, Remote)",
        "company": "Gun.io",
        "location": "Remote",
        "description": "Job SummaryWe are seeking a skilled Machine Learning Engineer to join our dynamic team. In this role, you will be responsible for designing, developing, and deploying machine learning models to solve complex problems and enhance our data-driven decision-making processes. You will work closely with data scientists and software engineers to implement robust machine learning solutions that leverage big data technologies and advanced analytics.\nDuties\n\n Develop and implement machine learning algorithms and models using frameworks such as TensorFlow, Spark, and SAS.\n Conduct data mining and preprocessing to prepare datasets for model training.\n Collaborate with cross-functional teams to understand business requirements and translate them into technical specifications.\n Design and optimize ETL processes for efficient data extraction, transformation, and loading.\n Deploy machine learning models into production environments ensuring scalability and reliability.\n Utilize AWS services for cloud-based model deployment and management.\n Engage in continuous learning of new technologies in AI, natural language processing, and quantum engineering.\n Document processes, methodologies, and results to ensure knowledge sharing within the team.\n\nQualifications\n\n Proficiency in programming languages such as Python, Java, C, and R.\n Strong understanding of machine learning concepts including supervised and unsupervised learning techniques.\n Experience with big data technologies such as Hadoop and analytics tools like Looker.\n Familiarity with database design principles and SQL for effective data manipulation.\n Knowledge of linked data principles and experience with tools like Talend for data integration.\n Experience in model training, evaluation, and deployment using various machine learning frameworks.\n Ability to work with Bash (Unix shell) for scripting tasks related to data processing.\n Excellent problem-solving skills with a strong analytical mindset. Join us in pushing the boundaries of technology through innovative machine learning solutions that drive impactful results.\n\nJob Type: Contract\nPay: $75.00 - $150.00 per hour\nExpected hours: 20 – 40 per week\nBenefits:\n\n Flexible schedule\n Referral program\n\nWork Location: Remote",
        "url": "https://www.indeed.com/viewjob?jk=4dcc0b2d82091b98",
        "source_url": "https://www.indeed.com/m/viewjob?jk=4dcc0b2d82091b98&from=serp&tk=1j4d2ba8egedm84o&xkcb=SoDl67M3tNMil_yNlx0IbzkdCdPP"
      },
      {
        "title": "Machine Learning Engineer",
        "company": "QuinStreet",
        "location": "Foster City, CA",
        "description": "\n \n  Powering Performance Marketplaces in Digital Media\n  QuinStreet is a pioneer in powering decentralized online marketplaces that match searchers and \"research and compare\" consumers with brands. We run these virtual- and private-label marketplaces in one of the nation's largest media networks.\n  Our industry leading segmentation and AI-driven matching technologies help consumers find better solutions and brands faster. They allow brands to target and reach in-market customer prospects with pinpoint segment-by-segment accuracy, and to pay only for performance results.\n  Our campaign-results-driven matching decision engines and optimization algorithms are built from over 20 years and billions of dollars of online media experience.\n  We believe in:\n  \n   The direct measurability of digital media.\n   Performance marketing. (We pioneered it.)\n   The advantages of technology.\n  \n  We bring all this together to deliver truly great results for consumers and brands in the world's biggest channel.\n \n \n  Job Category\n We're looking for an extremely smart Algorithms Engineer to become a core member of the team that creates algorithms for pricing, targeting, demand fulfillment, and fraud detection in our marketing platform.\n \n  Responsibilities\n \n  Use your expertise in machine learning and statistical learning techniques such as classification and regression to produce models applicable to pricing and targeting.\n  Apply mathematical optimization techniques to solve network problems.\n  Experiment and build models that improve the capabilities of our marketing platform and allow for increases in yield.\n  Work with our Engineering and Business teams to implement scalable, reliable and useful solutions for our various business units.\n  Run numerous experiments in a fast-paced, analytical culture so you can quickly learn and adapt your work.\n  Get the satisfaction of knowing that you helped connect millions of visitors to our affiliates and internal properties to the products and services they are searching for.\n \n Requirements\n \n  2+ years' experience in software development\n  MS in Computer Science or related area, or relevant work experience\n  Deep experience in applied machine learning, statistical learning, mathematical optimization and scalable computing\n  Experience with both supervised and unsupervised learning on large datasets\n  Succeed as an individual but to collaborate and strive for the success of your team\n  Strong sense of ownership in everything you build\n  Strong experience building production level code (Python is a plus)\n \n \n  \n   The expected salary range for this position is $140,000 USD to $170,000 USD annually. This salary range is an estimate, and the actual salary may vary based on the Company's compensation practices. The salary may be adjusted based on applicant's geographic location. The position is also eligible to receive performance bonus or commission and equity in the form of restricted stock units. This position is eligible to participate in the Company's standard employee benefits programs, which currently include health care benefits; (2) retirement benefits; (3) the amount of paid days off (paid sick leave, parental leave, paid time off, or vacation benefits); (4) any other tax-reportable benefits.\n  \n  \n  \n   #LI-REMOTE\n  \n \n \n \n \n \n  QuinStreet is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, national origin, pregnancy status, sex, age, marital status, disability, sexual orientation, gender identity or any other characteristics protected by law.\n  Please see QuinStreet's Employee Privacy Notice here.\n \n\n",
        "url": "https://www.indeed.com/viewjob?jk=48d33cf490158f04",
        "source_url": "https://www.indeed.com/m/viewjob?jk=48d33cf490158f04&from=serp&tk=1j4d2ba8egedm84o&xkcb=SoBr67M3tNMil_yNlx0PbzkdCdPP"
      },
      {
        "title": "Machine Learning / Software Engineer – Early-Stage AI Startup",
        "company": "Durlston Partners",
        "location": "California",
        "description": "\n\n \n  \n   \n    AI - ML\n   \n   \n    240,000 USD - 360,000 USD Base + Equity\n   \n   \n    California, London\n   \n   \n   \n    \n   \n  \n \n \n  \n   \n    A well-funded AI startup is building software to let anyone train AI models using the spare compute of their personal devices, an open, distributed alternative to billion-dollar clusters. Think: Folding@Home, but for training LLMs.\n    Founded by a team of Oxford grads and competitive programming talent, they’ve already raised ~$20M and launched a GitHub repo with 15k stars in four months. Now, they’re looking to scale their engineering team with a new wave of smart, ambitious developers.\n    This is a rare opportunity to work on distributed systems, low-level performance, and machine learning all in one, with the freedom to build in the open and ship quickly.\n     The Role:\n    \n     Build core infrastructure for decentralised AI training and inference.\n     Contribute across the stack, from systems-level code to ML pipelines.\n     Work closely with researchers and the founding team on a highly technical product.\n    \n    Ideal Candidates:\n    \n     Exceptional programmers with a track record in competitive programming (ICPC finalists, IOI/IMO/IPhO participants, etc.).\n     Graduates or early-career engineers preferred, the team is looking for high potential and hunger to grow.\n     Strong generalist skills, fast learners, and a passion for building new infrastructure from scratch.\n    \n   \n  \n \n\n",
        "url": "https://www.indeed.com/viewjob?jk=b4c7a33ba39cd9a6",
        "source_url": "https://www.indeed.com/m/viewjob?jk=b4c7a33ba39cd9a6&from=serp&tk=1j4d2ba8egedm84o&xkcb=SoDf67M3tNMil_yNlx0ObzkdCdPP"
      }
    ]
  }
}